IsWorkPlaneFlipped Property
Identifies if the instance's work plane is flipped.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsWorkPlaneFlipped { get; set; }
Visual Basic
Public Property IsWorkPlaneFlipped As Boolean
	Get
	Set
Visual C++
public:
property bool IsWorkPlaneFlipped {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInapplicableDataException |  Work plane cannot be flipped for this instance.
See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →